https://www.wordfrequency.info/samples.asp
sakes!PLURAL?
leaps!PLURAL?
award
jails!PLURAL?
bends!PLURAL?
melts!PLURAL?
waves!PLURAL?
cooks!PLURAL?
loves!PLURAL?
carbs!PLURAL?
fires!PLURAL?
exits!PLURAL?
drags!PLURAL?
timed
cures!PLURAL?
wraps!PLURAL?
cores!PLURAL?
wipes!PLURAL?
grips!PLURAL?
sinks!PLURAL?
irons!PLURAL?
flips!PLURAL?
casts!PLURAL?
tests!PLURAL?
gains!PLURAL?
shock
snuck
aging
rains!PLURAL?
rents!PLURAL?
nests!PLURAL?
snaps!PLURAL?
pleas!PLURAL?
urges!PLURAL?
fades!PLURAL?
forks!PLURAL?
aunts!PLURAL?
boils!PLURAL?
ranks!PLURAL?
kicks!PLURAL?
cords!PLURAL?
finer
leapt
stays!PLURAL?
tides!PLURAL?
tryin
lends!PLURAL?
wiser
decks!PLURAL?
shuts!PLURAL?
hides!PLURAL?
cages!PLURAL?
pours!PLURAL?
moods!PLURAL?
butts!PLURAL?
lawns!PLURAL?
racks!PLURAL?
loops!PLURAL?
spark
baths!PLURAL?
freak
ponds!PLURAL?
burnt
sands!PLURAL?
disks!PLURAL?
yells!PLURAL?
liars!PLURAL?
lords!PLURAL?
necks!PLURAL?
carts!PLURAL?
rains!PLURAL?
trail
spins!PLURAL?
signs!PLURAL?
flats!PLURAL?
sexes!PLURAL?
cooks!PLURAL?
evils!PLURAL?
slams!PLURAL?
slows!PLURAL?
moons!PLURAL?
desks!PLURAL?
carve
mills!PLURAL?
meats!PLURAL?
baked
malls!PLURAL?
earns!PLURAL?
flood
asses!PLURAL?
views!PLURAL?
soils!PLURAL?
cries!PLURAL?
worst
shone
spies!PLURAL?
nicer
blows!PLURAL?
hands!PLURAL?
drunk
roofs!PLURAL?
winds!PLURAL?
rises!PLURAL?
stems!PLURAL?
taxed
backs!PLURAL?
rules!PLURAL?
align
menus!PLURAL?
aided
pines!PLURAL?
await
fears!PLURAL?
enact
juror
flash
skins!PLURAL?
stops!PLURAL?
abuse
rails!PLURAL?
slips!PLURAL?
beats!PLURAL?
twist
strip
pause
borne
noses!PLURAL?
hints!PLURAL?
drift
gears!PLURAL?
mates!PLURAL?
shove
dudes!PLURAL?
joked
frame
drill
suing
ideal
tunes!PLURAL?
bleed
slice
cured
model
rolls!PLURAL?
eased
rides!PLURAL?
stems!PLURAL?
draft
hairs!PLURAL?
comin
comic
caves!PLURAL?
drown
plead
goats!PLURAL?
value
tying
burns!PLURAL?
feeds!PLURAL?
froze
wakes!PLURAL?
label
traps!PLURAL?
swore
gasps!PLURAL?
white
hooks!PLURAL?
dared
diets!PLURAL?
lamps!PLURAL?
crush
suits!PLURAL?
rings!PLURAL?
unite
cries!PLURAL?
tents!PLURAL?
tails!PLURAL?
sweep
clips!PLURAL?
flows!PLURAL?
leads!PLURAL?
opted
ounce
lifts!PLURAL?
mount
elder
sworn
belts!PLURAL?
icons!PLURAL?
cites!PLURAL?
fists!PLURAL?
bites!PLURAL?
saint
beams!PLURAL?
exams!PLURAL?
ropes!PLURAL?
seals!PLURAL?
sacks!PLURAL?
greet
crawl
chefs!PLURAL?
pitch
march
cakes!PLURAL?
raced
thigh
warns!PLURAL?
rests!PLURAL?
lasts!PLURAL?
horns!PLURAL?
locks!PLURAL?
kicks!PLURAL?
saves!PLURAL?
float
dates!PLURAL?
blend
acids!PLURAL?
dried
riots!PLURAL?
rival
drums!PLURAL?
local
dolls!PLURAL?
cheer
troop
blows!PLURAL?
shout
rides!PLURAL?
spill
flown
punch
seize
weeds!PLURAL?
flows!PLURAL?
flies!PLURAL?
house
black
pains!PLURAL?
coats!PLURAL?
elect
piles!PLURAL?
doses!PLURAL?
pumps!PLURAL?
leans!PLURAL?
lists!PLURAL?
wines!PLURAL?
poets!PLURAL?
beers!PLURAL?
stamp
steps!PLURAL?
rider
ports!PLURAL?
beats!PLURAL?
ashes!PLURAL?
arose
poses!PLURAL?
tones!PLURAL?
myths!PLURAL?
jumps!PLURAL?
plots!PLURAL?
cheat
bears!PLURAL?
gases!PLURAL?
masks!PLURAL?
waits!PLURAL?
sings!PLURAL?
cease
chunk
fools!PLURAL?
bowls!PLURAL?
faded
spell
rumor
coins!PLURAL?
trait
marks!PLURAL?
gangs!PLURAL?
fills!PLURAL?
crash
flies!PLURAL?
venue
lanes!PLURAL?
packs!PLURAL?
links!PLURAL?
reply
walks!PLURAL?
freed
halls!PLURAL?
plain
stuff
worry
yield
drain
wires!PLURAL?
pipes!PLURAL?
drops!PLURAL?
brush
wells!PLURAL?
sneak
glove
delay
pools!PLURAL?
merit
helps!PLURAL?
modes!PLURAL?
debts!PLURAL?
shine
grasp
palms!PLURAL?
herbs!PLURAL?
rebel
safer
flaws!PLURAL?
newer
heads!PLURAL?
peaks!PLURAL?
meter
turns!PLURAL?
skies!PLURAL?
worse
loads!PLURAL?
range
ducks!PLURAL?
speed
mines!PLURAL?
spare
limbs!PLURAL?
bikes!PLURAL?
shell
alien
slice
forms!PLURAL?
trace
stack
tooth
poles!PLURAL?
imply
tuned
thief
grabs!PLURAL?
tubes!PLURAL?
demon
donor
scout
dated
hangs!PLURAL?
aides!PLURAL?
risen
bells!PLURAL?
whale
swung
lacks!PLURAL?
fuels!PLURAL?
trace
sense
flags!PLURAL?
roses!PLURAL?
shark
arrow
bulls!PLURAL?
chase
rises!PLURAL?
rolls!PLURAL?
plant
shape
steak
clues!PLURAL?
buses!PLURAL?
charm
twist
buyer
crews!PLURAL?
downs!PLURAL?
flame
punch
verse
deals!PLURAL?
likes!PLURAL?
spell
wagon
slide
swing
organ
tumor
slide
crack
elbow
diary
scare
favor
arabs!PLURAL?
adapt
stare
sucks!PLURAL?
guard
hates!PLURAL?
nails!PLURAL?
loser
wound
tires!PLURAL?
hears!PLURAL?
grams!PLURAL?
aisle
boost
ankle
weigh
armed
socks!PLURAL?
towel
screw
tapes!PLURAL?
booth
store
kings!PLURAL?
slope
yield
tours!PLURAL?
risky
burst
pairs!PLURAL?
waved
norms!PLURAL?
graph
bride
steep
lions!PLURAL?
stiff
posed
lungs!PLURAL?
arise
wound
hosts!PLURAL?
zones!PLURAL?
eagle
skirt
blast
poems!PLURAL?
orbit
raped
drops!PLURAL?
alley
witch
clerk
radar
reply
wiped
grant
light
sunny
irony
usage
vocal
alter
wrist
kills!PLURAL?
gates!PLURAL?
fancy
wheat
fleet
sighs!PLURAL?
blown
loses!PLURAL?
theft
draws!PLURAL?
laser
asset
giant
wears!PLURAL?
paths!PLURAL?
backs!PLURAL?
brush
blank
rally
dough
fluid
grant
drank
robot
grave
novel
medal
shelf
pulse
blame
snake
lakes!PLURAL?
sells!PLURAL?
stays!PLURAL?
suits!PLURAL?
comic
seeks!PLURAL?
dutch
skull
bonus!PLURAL?
spite
looks!PLURAL?
trade
loyal
codes!PLURAL?
purse
pause
cruel
liver
rated
civic
thumb
catch
urged
flash
talks!PLURAL?
midst
apart
alike
arena
sheer
pound
dying
bases!PLURAL?
shore
tales!PLURAL?
pills!PLURAL?
suite
trunk
blogs!PLURAL?
sends!PLURAL?
shade
genre
mixed
eaten
dream
fever
cheek
squad
cloth
added
grain
patch
bands!PLURAL?
crack
lined
cliff
delay
block
bombs!PLURAL?
swept
bless
realm
honor
guess
sadly
alpha
smile
level
souls!PLURAL?
onion
awake
blade
score
curve
ridge
alien
dress
debut
falls!PLURAL?
winds!PLURAL?
lobby
rings!PLURAL?
maker
cared
brick
tanks!PLURAL?
fires!PLURAL?
olive
leave
print
crops!PLURAL?
ranks!PLURAL?
steam
sweat
lists!PLURAL?
flood
panic
sheep
issue
rifle
given
nerve
reach
marks!PLURAL?
dates!PLURAL?
moves!PLURAL?
quest
heels!PLURAL?
mercy
fails!PLURAL?
alarm
boats!PLURAL?
smoke
grief
wives!PLURAL?
kinda
major
chase
tribe
final
fixed
sizes!PLURAL?
belly
react
hurts!PLURAL?
faces!PLURAL?
input
jokes!PLURAL?
dealt
toxic
flour
farms!PLURAL?
waste
tends!PLURAL?
guide
edges!PLURAL?
forty
unity
outer
tiger
crown
grows!PLURAL?
array
teens!PLURAL?
harsh
lover
acted
climb
mouse
camps!PLURAL?
twins!PLURAL?
blues!PLURAL?
nasty
laugh
wider
shops!PLURAL?
ranch
above
beast
known
taste
lower
gross
adopt
sword
trips!PLURAL?
trash
joins!PLURAL?
hopes!PLURAL?
train
meets!PLURAL?
brave
cabin
deals!PLURAL?
slave
paint
prior
opera
jeans!PLURAL?
track
wages!PLURAL?
knock
greek
quote
picks!PLURAL?
label
craft
upset
chips!PLURAL?
stole
piano
mount
lemon
porch
strip
habit
swing
mommy
short
quote
fears!PLURAL?
pitch
stake
plays!PLURAL?
dozen
fixed
chaos!PLURAL?
chart
glory
reads!PLURAL?
guilt
daily
hurry
shift
stick
limit
clubs!PLURAL?
roman
sixth
globe
cares!PLURAL?
eager
cents!PLURAL?
beans!PLURAL?
voter
towns!PLURAL?
valid
meals!PLURAL?
bucks!PLURAL?
gains!PLURAL?
slept
peers!PLURAL?
trick
fiber
corps!PLURAL?
ruled
texts!PLURAL?
favor
pizza
idiot
hated
acres!PLURAL?
salad
smell
fence
lands!PLURAL?
spots!PLURAL?
seeds!PLURAL?
essay
devil
cried
pulls!PLURAL?
ghost
swear
bears!PLURAL?
layer
shake
steal
plain
mixed
refer
couch
tight
hopes!PLURAL?
rapid
bench
candy
forum
upset
wings!PLURAL?
green
races!PLURAL?
aimed
tight
ratio
sorts!PLURAL?
smell
scope
irish
elite
paint
limit
press
boots!PLURAL?
scary
human
cited
ships!PLURAL?
bonds!PLURAL?
boxes!PLURAL?
fifty
grace
gifts!PLURAL?
motor
order
angel
magic
buddy
crash
balls!PLURAL?
bound
notes!PLURAL?
split
flesh
falls!PLURAL?
cross
parks!PLURAL?
dozen
humor
angle
walks!PLURAL?
hence
males!PLURAL?
genes!PLURAL?
count
latin
stops!PLURAL?
depth
vital
round
coach
wrong
round
tasks!PLURAL?
magic
badly
favor
silly
newly
dance
tower
holes!PLURAL?
links!PLURAL?
rocks!PLURAL?
virus!PLURAL?
drunk
naked
creek
logic
prize
loose
match
wheel
relax
roots!PLURAL?
ideal
costs!PLURAL?
clear
fraud
plans!PLURAL?
pride
woods!PLURAL?
doubt
sheet
islam
clean
waves!PLURAL?
dying
index
offer
roads!PLURAL?
shame
clock
print
since
armed
match
awful
bones!PLURAL?
juice
cloud
hoped
given
nurse
sauce
rough
tries!PLURAL?
marry
shift
worth
loans!PLURAL?
laugh
force
knees!PLURAL?
drama
hills!PLURAL?
draft
skill
moves!PLURAL?
inner
royal
opens!PLURAL?
brand
pilot
exact
shock
asian
hired
roles!PLURAL?
stand
firms!PLURAL?
entry
cross
cable
smoke
click
risks!PLURAL?
knife
minor
files!PLURAL?
blind
seats!PLURAL?
fifth
grass
steel
dirty
pants!PLURAL?
bitch
giant
solve
talks!PLURAL?
study
anger
filed
phase
sharp
judge
trend
ahead
polls!PLURAL?
route
posts!PLURAL?
error
total
owned
watch
joint
prior
minds!PLURAL?
cycle
chain
taste
begun
proof
iraqi
frame
brief
faces!PLURAL?
foods!PLURAL?
goods!PLURAL?
faced
theme
touch
usual
guide
bread
actor
units!PLURAL?
fruit
rural
still
award
doubt
cheap
drink
stick
likes!PLURAL?
shook
threw
shots!PLURAL?
trail
bills!PLURAL?
waste
plate
queen
drawn
tears!PLURAL?
count
rooms!PLURAL?
loves!PLURAL?
noise
trust
blame
occur
birds!PLURAL?
guest
broad
solar
score
being
first
treat
drove
topic
cream
check
visit
shirt
claim
thick
bible
upper
later
whole
touch
chose
finds!PLURAL?
fewer
album
below
plays!PLURAL?
shows!PLURAL?
panel
teeth
films!PLURAL?
enemy
claim
fault
voted
leads!PLURAL?
lives!PLURAL?
holds!PLURAL?
dress
drink
aside
solid
saved
stuck
metal
sound
dance
honor
point
ocean
sport
novel
fired
weird
FALSE
email
sight
other
brown
grade
apart
admit
doors!PLURAL?
ought
daddy
train
forth
grown
bunch
chest
votes!PLURAL?
cards!PLURAL?
uncle
heads!PLURAL?
adult
songs!PLURAL?
argue
cover
helps!PLURAL?
horse
super
notes!PLURAL?
guard
sugar
lying
urban
prime
keeps!PLURAL?
share
calls!PLURAL?
yours
enter
under
shoot
walls!PLURAL?
banks!PLURAL?
shape
shoes!PLURAL?
sleep
apply
equal
smile
mayor
block
signs!PLURAL?
front
owner
abuse
pages!PLURAL?
tools!PLURAL?
views!PLURAL?
empty
forms!PLURAL?
youth
works!PLURAL?
storm
tired
tests!PLURAL?
truck
stone
lunch
coast
place
grand
lucky
kinds!PLURAL?
proud
angry
sleep
yards!PLURAL?
close
drive
chief
exist
visit
light
plane
funds!PLURAL?
catch
facts!PLURAL?
broke
users!PLURAL?
honey
chief
prove
crowd
goals!PLURAL?
scale
smart
noted
throw
close
clean
agent
state
calls!PLURAL?
quiet
track
speed
birth
moral
teach
sites!PLURAL?
judge
focus
cells!PLURAL?
fight
sides!PLURAL?
plant
types!PLURAL?
cover
liked
above
apple
daily
beach
twice
chair
worst
homes!PLURAL?
below
trust
cause
fully
raise
steps!PLURAL?
extra
aware
front
sweet
start
tells!PLURAL?
coach
until
means
title
items!PLURAL?
dream
needs!PLURAL?
terms!PLURAL?
carry
ended
feels!PLURAL?
folks!PLURAL?
trees!PLURAL?
spoke
terms!PLURAL?
names!PLURAL?
labor
truly
drive
stars!PLURAL?
alone
hotel
teams!PLURAL?
basis
alive
stock
heavy
taxes!PLURAL?
fight
turns!PLURAL?
quick
glass
sales!PLURAL?
enjoy
style
plans!PLURAL?
costs!PLURAL?
trial
break
break
drugs!PLURAL?
avoid
reach
shown
basic
along
tough
fresh
april
funny
serve
faith
mouth
worse
loved
rates!PLURAL?
worry
radio
named
while
worth
civil
crime
front
union
stood
stage
early
added
range
parts!PLURAL?
alone
brain
march
crazy
hello
lines!PLURAL?
store
offer
gives!PLURAL?
shall
trade
lived
river
scene
above
peace
lower
total
ahead
meant
share
build
built
rules!PLURAL?
shows!PLURAL?
ideas!PLURAL?
sound
green
older
image
event
works!PLURAL?
spend
miles!PLURAL?
check
allow
close
eight
since
staff
final
legal
piece
order
stand
board
floor
seven
price
begin
cause
write
speak
press
areas!PLURAL?
moved
girls!PLURAL?
south
value
color
force
agree
cases!PLURAL?
paper
spent
wrote
short
photo
video
model
lives!PLURAL?
other
needs!PLURAL?
movie
earth
books!PLURAL?
truth
watch
games!PLURAL?
blood
light
north
knows!PLURAL?
learn
guess
stuff
whose
field
month
ready
takes!PLURAL?
voice
third
happy
weeks!PLURAL?
space
clear
means!PLURAL?
media
tried
wants!PLURAL?
class
phone
looks!PLURAL?
known
major
early
level
along
quite
began
based
hands!PLURAL?
issue
taken
heart
given
bring
local
hours!PLURAL?
wrong
death
leave
words!PLURAL?
start
seems!PLURAL?
table
sense
court
large
comes!PLURAL?
music
heard
study
whole
human
right
sorry
child
party
white
makes!PLURAL?
using
among
young
later
black
often
asked
least
power
woman
small
group
until
story
thank
water
after
times!PLURAL?
since
right
under
maybe
point
place
night
today
money
found
women
doing
about
house
where
state
might
again
great
every
three
thing
while
where
being
world
never
after
still
right
there
those
years!PLURAL?
first
going
these
other
think
could
which
there
would
their
about
