https://www.wordfrequency.info/samples.asp
sakes
leaps
award
jails
bends
melts
waves
cooks
loves
carbs
fires
exits
drags
timed
cures
wraps
cores
wipes
grips
sinks
irons
flips
casts
tests
gains
shock
snuck
aging
rains
rents
nests
snaps
pleas
urges
fades
forks
aunts
boils
ranks
kicks
cords
finer
leapt
stays
tides
tryin
lends
wiser
decks
shuts
hides
cages
pours
moods
butts
lawns
racks
loops
spark
baths
freak
ponds
burnt
sands
disks
yells
liars
lords
necks
carts
rains
trail
spins
signs
flats
sexes
cooks
evils
slams
slows
moons
desks
carve
mills
meats
baked
malls
earns
flood
asses
views
soils
cries
worst
shone
spies
nicer
blows
hands
drunk
roofs
winds
rises
stems
taxed
backs
rules
align
menus
aided
pines
await
fears
enact
juror
flash
skins
stops
abuse
rails
slips
beats
twist
strip
pause
borne
noses
hints
drift
gears
mates
shove
dudes
joked
frame
drill
suing
ideal
tunes
bleed
slice
cured
model
rolls
eased
rides
stems
draft
hairs
comin
comic
caves
drown
plead
goats
value
tying
burns
feeds
froze
wakes
label
traps
swore
gasps
white
hooks
dared
diets
lamps
crush
suits
rings
unite
cries
tents
tails
sweep
clips
flows
leads
opted
ounce
lifts
mount
elder
sworn
belts
icons
cites
fists
bites
saint
beams
exams
ropes
seals
sacks
greet
crawl
chefs
pitch
march
cakes
raced
thigh
warns
rests
lasts
horns
locks
kicks
saves
float
dates
blend
acids
dried
riots
rival
drums
local
dolls
cheer
troop
blows
shout
rides
spill
flown
punch
seize
weeds
flows
flies
house
black
pains
coats
elect
piles
doses
pumps
leans
lists
wines
poets
beers
stamp
steps
rider
ports
beats
ashes
arose
poses
tones
myths
jumps
plots
cheat
bears
gases
masks
waits
sings
cease
chunk
fools
bowls
faded
spell
rumor
coins
trait
marks
gangs
fills
crash
flies
venue
lanes
packs
links
reply
walks
freed
halls
plain
stuff
worry
yield
drain
wires
pipes
drops
brush
wells
sneak
glove
delay
pools
merit
helps
modes
debts
shine
grasp
palms
herbs
rebel
safer
flaws
newer
heads
peaks
meter
turns
skies
worse
loads
range
ducks
speed
mines
spare
limbs
bikes
shell
alien
slice
forms
trace
stack
tooth
poles
imply
tuned
thief
grabs
tubes
demon
donor
scout
dated
hangs
aides
risen
bells
whale
swung
lacks
fuels
trace
sense
flags
roses
shark
arrow
bulls
chase
rises
rolls
plant
shape
steak
clues
buses
charm
twist
buyer
crews
downs
flame
punch
verse
deals
likes
spell
wagon
slide
swing
organ
tumor
slide
crack
elbow
diary
scare
favor
arabs
adapt
stare
sucks
guard
hates
nails
loser
wound
tires
hears
grams
aisle
boost
ankle
weigh
armed
socks
towel
screw
tapes
booth
store
kings
slope
yield
tours
risky
burst
pairs
waved
norms
graph
bride
steep
lions
stiff
posed
lungs
arise
wound
hosts
zones
eagle
skirt
blast
poems
orbit
raped
drops
alley
witch
clerk
radar
reply
wiped
grant
light
sunny
irony
usage
vocal
alter
wrist
kills
gates
fancy
wheat
fleet
sighs
blown
loses
theft
draws
laser
asset
giant
wears
paths
backs
brush
blank
rally
dough
fluid
grant
drank
robot
grave
novel
medal
shelf
pulse
blame
snake
lakes
sells
stays
suits
comic
seeks
dutch
skull
bonus
spite
looks
trade
loyal
codes
purse
pause
cruel
liver
rated
civic
thumb
catch
urged
flash
talks
midst
apart
alike
arena
sheer
pound
dying
bases
shore
tales
pills
suite
trunk
blogs
sends
shade
genre
mixed
eaten
dream
fever
cheek
squad
cloth
added
grain
patch
bands
crack
lined
cliff
delay
block
bombs
swept
bless
realm
honor
guess
sadly
alpha
smile
level
souls
onion
awake
blade
score
curve
ridge
alien
dress
debut
falls
winds
lobby
rings
maker
cared
brick
tanks
fires
olive
leave
print
crops
ranks
steam
sweat
lists
flood
panic
sheep
issue
rifle
given
nerve
reach
marks
dates
moves
quest
heels
mercy
fails
alarm
boats
smoke
grief
wives
kinda
major
chase
tribe
final
fixed
sizes
belly
react
hurts
faces
input
jokes
dealt
toxic
flour
farms
waste
tends
guide
edges
forty
unity
outer
tiger
crown
grows
array
teens
harsh
lover
acted
climb
mouse
camps
twins
blues
nasty
laugh
wider
shops
ranch
above
beast
known
taste
lower
gross
adopt
sword
trips
trash
joins
hopes
train
meets
brave
cabin
deals
slave
paint
prior
opera
jeans
track
wages
knock
greek
quote
picks
label
craft
upset
chips
stole
piano
mount
lemon
porch
strip
habit
swing
mommy
short
quote
fears
pitch
stake
plays
dozen
fixed
chaos
chart
glory
reads
guilt
daily
hurry
shift
stick
limit
clubs
roman
sixth
globe
cares
eager
cents
beans
voter
towns
valid
meals
bucks
gains
slept
peers
trick
fiber
corps
ruled
texts
favor
pizza
idiot
hated
acres
salad
smell
fence
lands
spots
seeds
essay
devil
cried
pulls
ghost
swear
bears
layer
shake
steal
plain
mixed
refer
couch
tight
hopes
rapid
bench
candy
forum
upset
wings
green
races
aimed
tight
ratio
sorts
smell
scope
irish
elite
paint
limit
press
boots
scary
human
cited
ships
bonds
boxes
fifty
grace
gifts
motor
order
angel
magic
buddy
crash
balls
bound
notes
split
flesh
falls
cross
parks
dozen
humor
angle
walks
hence
males
genes
count
latin
stops
depth
vital
round
coach
wrong
round
tasks
magic
badly
favor
silly
newly
dance
tower
holes
links
rocks
virus
drunk
naked
creek
logic
prize
loose
match
wheel
relax
roots
ideal
costs
clear
fraud
plans
pride
woods
doubt
sheet
islam
clean
waves
dying
index
offer
roads
shame
clock
print
since
armed
match
awful
bones
juice
cloud
hoped
given
nurse
sauce
rough
tries
marry
shift
worth
loans
laugh
force
knees
drama
hills
draft
skill
moves
inner
royal
opens
brand
pilot
exact
shock
asian
hired
roles
stand
firms
entry
cross
cable
smoke
click
risks
knife
minor
files
blind
seats
fifth
grass
steel
dirty
pants
bitch
giant
solve
talks
study
anger
filed
phase
sharp
judge
trend
ahead
polls
route
posts
error
total
owned
watch
joint
prior
minds
cycle
chain
taste
begun
proof
iraqi
frame
brief
faces
foods
goods
faced
theme
touch
usual
guide
bread
actor
units
fruit
rural
still
award
doubt
cheap
drink
stick
likes
shook
threw
shots
trail
bills
waste
plate
queen
drawn
tears
count
rooms
loves
noise
trust
blame
occur
birds
guest
broad
solar
score
being
first
treat
drove
topic
cream
check
visit
shirt
claim
thick
bible
upper
later
whole
touch
chose
finds
fewer
album
below
plays
shows
panel
teeth
films
enemy
claim
fault
voted
leads
lives
holds
dress
drink
aside
solid
saved
stuck
metal
sound
dance
honor
point
ocean
sport
novel
fired
weird
FALSE
email
sight
other
brown
grade
apart
admit
doors
ought
daddy
train
forth
grown
bunch
chest
votes
cards
uncle
heads
adult
songs
argue
cover
helps
horse
super
notes
guard
sugar
lying
urban
prime
keeps
share
calls
yours
enter
under
shoot
walls
banks
shape
shoes
sleep
apply
equal
smile
mayor
block
signs
front
owner
abuse
pages
tools
views
empty
forms
youth
works
storm
tired
tests
truck
stone
lunch
coast
place
grand
lucky
kinds
proud
angry
sleep
yards
close
drive
chief
exist
visit
light
plane
funds
catch
facts
broke
users
honey
chief
prove
crowd
goals
scale
smart
noted
throw
close
clean
agent
state
calls
quiet
track
speed
birth
moral
teach
sites
judge
focus
cells
fight
sides
plant
types
cover
liked
focus
above
apple
daily
beach
twice
chair
worst
homes
below
trust
cause
fully
raise
steps
extra
aware
front
sweet
start
tells
coach
until
means
title
items
dream
needs
terms
carry
ended
feels
folks
trees
spoke
terms
names
labor
truly
drive
stars
alone
hotel
teams
basis
alive
stock
heavy
taxes
fight
turns
quick
glass
sales
enjoy
style
plans
costs
trial
break
break
drugs
avoid
reach
shown
basic
along
tough
fresh
april
funny
serve
faith
mouth
worse
loved
rates
worry
radio
named
while
worth
civil
crime
front
union
stood
stage
early
added
range
parts
alone
brain
march
crazy
hello
lines
store
offer
gives
shall
trade
lived
river
scene
above
peace
lower
total
ahead
meant
share
build
built
rules
shows
ideas
sound
green
older
image
event
works
spend
miles
check
allow
close
eight
since
staff
final
legal
piece
order
stand
board
floor
seven
price
begin
cause
write
speak
press
areas
moved
girls
south
value
color
force
agree
cases
paper
spent
wrote
short
photo
video
model
lives
other
needs
movie
earth
books
truth
watch
games
blood
light
north
knows
learn
guess
stuff
whose
field
month
ready
takes
voice
third
happy
weeks
space
clear
means
media
tried
wants
class
phone
looks
known
major
early
level
along
quite
began
based
hands
issue
taken
heart
given
bring
local
hours
wrong
death
leave
words
start
seems
table
sense
court
large
comes
music
heard
study
whole
human
right
sorry
child
party
white
makes
using
among
young
later
black
often
asked
least
power
woman
small
group
until
story
thank
water
after
times
since
right
under
maybe
point
place
night
today
money
found
women
doing
about
house
where
state
might
again
great
every
three
thing
while
where
being
world
never
after
still
right
there
those
years
first
going
these
other
think
could
which
there
would
their
about
